
===========================================================================
report_tns
============================================================================
tns -109.68

===========================================================================
report_wns
============================================================================
wns -0.98

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -0.98

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack -0.10
