
===========================================================================
report_tns
============================================================================
tns -216.01

===========================================================================
report_wns
============================================================================
wns -1.29

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -1.29

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack -0.12
